; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v13 ?v6)
             (pred_3 ?v3 ?v12)
             (pred_9 ?v13 ?v12)
             (pred_11 ?v2 ?v13 )
	     (pred_6 ?v13)
             (pred_12 ?v7)
             (pred_10 ?v3)
             (pred_4 ?v12)
             (pred_7 ?v13)
             (pred_5 ?v3)
             (pred_2 ?v13)
             (pred_8 ))



(:action op_1
:parameters (?v1 ?v5 ?v10 ?v8)
:precondition (and (pred_12 ?v1) (pred_12 ?v5) (pred_10 ?v10) (pred_4 ?v8)
          (pred_1 ?v1 ?v5) (pred_3 ?v10 ?v8)
                   (pred_9 ?v5 ?v8) (pred_6 ?v1) 
                   (pred_7 ?v5) (pred_5 ?v10))
:effect (and  (pred_2 ?v5) (not (pred_7 ?v5))))


(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_12 ?v1) (pred_12 ?v11)
               (pred_6 ?v1) (pred_1 ?v1 ?v11) (pred_2 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v1))))

(:action op_2
:parameters (?v1 ?v10)
:precondition (and (pred_12 ?v1) (pred_10 ?v10) 
                  (pred_6 ?v1) (pred_11 ?v10 ?v1) (pred_8 ))
:effect (and (pred_5 ?v10)
   (not (pred_11 ?v10 ?v1)) (not (pred_8 ))))


(:action op_3
:parameters (?v1 ?v4 ?v9)
:precondition (and (pred_12 ?v1) (pred_10 ?v4) (pred_10 ?v9)
                  (pred_6 ?v1) (pred_5 ?v9) (pred_11 ?v4 ?v1))
:effect (and (pred_5 ?v4) (pred_11 ?v9 ?v1)
        (not (pred_5 ?v9)) (not (pred_11 ?v4 ?v1))))

(:action op_4
:parameters (?v1 ?v10)
:precondition (and (pred_12 ?v1) (pred_10 ?v10) 
                  (pred_6 ?v1) (pred_5 ?v10))
:effect (and (pred_8 ) (pred_11 ?v10 ?v1) (not (pred_5 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_06 obj_02 obj_12 obj_20 obj_16 obj_28 obj_01 obj_11 obj_18 obj_22 obj_21 obj_13 obj_26 obj_10 obj_17 obj_04 obj_31 obj_24 obj_19 obj_03 obj_09 obj_07 obj_25 obj_27
    obj_29 obj_05 obj_14
    obj_08 obj_30 obj_15
    )

    (:init
       (pred_8)

       (pred_12 obj_23)
       (pred_12 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_12)
       (pred_12 obj_20)
       (pred_12 obj_16)
       (pred_12 obj_28)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_18)
       (pred_12 obj_22)
       (pred_12 obj_21)
       (pred_12 obj_13)
       (pred_12 obj_26)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_04)
       (pred_12 obj_31)
       (pred_12 obj_24)
       (pred_12 obj_19)
       (pred_12 obj_03)
       (pred_12 obj_09)
       (pred_12 obj_07)
       (pred_12 obj_25)
       (pred_12 obj_27)
       (pred_4 obj_29)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_10 obj_08)
       (pred_10 obj_30)
       (pred_10 obj_15)

       (pred_1 obj_23 obj_16)
       (pred_1 obj_23 obj_06)
       (pred_1 obj_06 obj_28)
       (pred_1 obj_06 obj_02)
       (pred_1 obj_06 obj_23)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_02 obj_06)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_16 obj_28)
       (pred_1 obj_16 obj_23)
       (pred_1 obj_28 obj_21)
       (pred_1 obj_28 obj_01)
       (pred_1 obj_28 obj_06)
       (pred_1 obj_28 obj_16)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_28)
       (pred_1 obj_11 obj_26)
       (pred_1 obj_11 obj_18)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_18 obj_10)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_22 obj_17)
       (pred_1 obj_22 obj_21)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_21 obj_04)
       (pred_1 obj_21 obj_13)
       (pred_1 obj_21 obj_28)
       (pred_1 obj_21 obj_22)
       (pred_1 obj_13 obj_31)
       (pred_1 obj_13 obj_26)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_13 obj_21)
       (pred_1 obj_26 obj_24)
       (pred_1 obj_26 obj_10)
       (pred_1 obj_26 obj_11)
       (pred_1 obj_26 obj_13)
       (pred_1 obj_10 obj_19)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_10 obj_26)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_04)
       (pred_1 obj_17 obj_22)
       (pred_1 obj_04 obj_09)
       (pred_1 obj_04 obj_31)
       (pred_1 obj_04 obj_21)
       (pred_1 obj_04 obj_17)
       (pred_1 obj_31 obj_07)
       (pred_1 obj_31 obj_24)
       (pred_1 obj_31 obj_13)
       (pred_1 obj_31 obj_04)
       (pred_1 obj_24 obj_25)
       (pred_1 obj_24 obj_19)
       (pred_1 obj_24 obj_26)
       (pred_1 obj_24 obj_31)
       (pred_1 obj_19 obj_27)
       (pred_1 obj_19 obj_10)
       (pred_1 obj_19 obj_24)
       (pred_1 obj_03 obj_09)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_09 obj_04)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_07 obj_25)
       (pred_1 obj_07 obj_31)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_25 obj_27)
       (pred_1 obj_25 obj_24)
       (pred_1 obj_25 obj_07)
       (pred_1 obj_27 obj_19)
       (pred_1 obj_27 obj_25)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_7 obj_12)
       (pred_9  obj_06 obj_29)
       (pred_9  obj_10 obj_05)
       (pred_9  obj_12 obj_14)
       (pred_2 obj_23)
       (pred_2 obj_02)
       (pred_2 obj_20)
       (pred_2 obj_16)
       (pred_2 obj_28)
       (pred_2 obj_01)
       (pred_2 obj_11)
       (pred_2 obj_18)
       (pred_2 obj_22)
       (pred_2 obj_21)
       (pred_2 obj_13)
       (pred_2 obj_26)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_31)
       (pred_2 obj_24)
       (pred_2 obj_19)
       (pred_2 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_07)
       (pred_2 obj_25)
       (pred_2 obj_27)

       (pred_3  obj_08 obj_29)
       (pred_3  obj_30 obj_05)
       (pred_3  obj_15 obj_14)
       (pred_11 obj_08 obj_09)
       (pred_11 obj_30 obj_19)
       (pred_11 obj_15 obj_09)
       (pred_6 obj_02)
    )

    (:goal (and
       (pred_11 obj_08 obj_17)
    ))
(:constraints
  (always (not (pred_6 obj_04)))
)
)

; plan
1. (op_5 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_01)
   goals met: 0 of 1
2. (op_5 obj_01 obj_13)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_13)
   goals met: 0 of 1
3. (op_5 obj_13 obj_31)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_31)
   goals met: 0 of 1
4. (op_5 obj_31 obj_07)
   deleted: (pred_6 obj_31)
   added: (pred_6 obj_07)
   goals met: 0 of 1
5. (op_5 obj_07 obj_09)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_09)
   goals met: 0 of 1
6. (op_2 obj_09 obj_08)
   deleted: (pred_11 obj_08 obj_09) (pred_8)
   added: (pred_5 obj_08)
   goals met: 0 of 1
7. (op_5 obj_09 obj_03)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_03)
   goals met: 0 of 1
8. (op_5 obj_03 obj_17)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_17)
   goals met: 0 of 1
9. (op_4 obj_17 obj_08)
   deleted: (pred_5 obj_08)
   added: (pred_8) (pred_11 obj_08 obj_17)
   goals met: 1 of 1
